# Removendo duplicatas

In [1]:
import pandas as pd

In [4]:
data = {
    "Nome": ["Téo", "Nah", "Maria", "Nah", "Lara", "Téo"],
    "Idade": [32,33,2,33,31,32],
}

df = pd.DataFrame(data)
df

    Nome  Idade
0    Téo     32
1    Nah     33
2  Maria      2
3    Nah     33
4   Lara     31
5    Téo     32

In [5]:
# Removendo linhas duplicadas
df = df.drop_duplicates()
df

    Nome  Idade
0    Téo     32
1    Nah     33
2  Maria      2
4   Lara     31

In [14]:
data = {
    "Nome": ["Téo", "Nah", "Maria", "Nah", "Lara", "Téo"],
    "Idade": [32,33,2,33,31,32],
    "updated_at":[1,2,3,1,2,3]
}

df = pd.DataFrame(data)

# Ordenando para os ultimos atualizados ficarem no topo
df = df.sort_values(by="updated_at", ascending=False)

# Removendo as linhas que foram atualizadas
# O keep first faz manter as primeiras linhas
df = df.drop_duplicates(subset=["Nome", "Idade"], keep="first")
df

    Nome  Idade  updated_at
5    Téo     32           3
2  Maria      2           3
4   Lara     31           2
1    Nah     33           2

In [15]:
data = {
    "Nome": ["Téo", "Nah", "Maria", "Nah", "Lara", "Téo"],
    "Idade": [32,33,2,33,31,32],
    "updated_at":[1,2,3,1,2,3]
}

df = pd.DataFrame(data)

# Encadeando os comandos acima
df = (
        df.sort_values(by="updated_at", ascending=False)
        .drop_duplicates(subset=["Nome", "Idade"], keep="first")
    )
df

    Nome  Idade  updated_at
5    Téo     32           3
2  Maria      2           3
4   Lara     31           2
1    Nah     33           2